/* eslint-disable react/no-unescaped-entities */
import Image from "next/image";
import React,{useState, useEffect} from "react";
import image from "../../public/images/coffe.jpg";
import homeimg from "../../public/images/bible_bg.jpeg";
import Link from "next/link";
import "./home.css";

function page() {
  return (
    <div className="flex flex-col items-center justify-center ">
      <div className="home-welcome">
        <h1>
          Welcome
          <br />
          እንኳን ደህና መጡ !
        </h1>
      </div>
      <div className="intro">
        <p className="intro-notice">
          {" "}
          እነዚሀ ሁሉ መጽሐፍት ከሌሎች ጥቂት የእግሊዝኛ መጽሐፍት ጋር በሲዲ ተዘጋጅተው ለግዢ ዝግጁ ናቸው፡፡ የበለጠ
          ለመረዳት በtexlap@juno.com ጻፉልን፡፡{" "}
        </p>
        <p className="intro-site-description">
          እንኳን ወደ ጥሩ የአማርኛ መጽሐፍት በደህና መጡ. ይህ ድረ-ገጽ በተለያዩ የክርስቲያን ጉዳዮች ላይ ነፃ፣
          ሊወርዱ የሚችሉ የአማርኛ መጽሃፎችን ይዟል. በዓለም ዙሪያ ባሉ አታሚዎች የተለገሱ እነዚህ መጻሕፍት ወደ
          የእግዚአብሔር እውቀት ከማስጨበጥም አልፎ በዕለት ተዕለት የእግር ጉዞዎ መመሪያ ይሰጥዎታል. አላማችን እነዚህን
          መጽሃፎች በተቻለ መጠን ለብዙ ሰዎች ማካፈል ነው፣ ስለዚህ ነፃነት ይሰማዎት መጽሃፎቹን እና ቃሉን ለማሰራጨት!
        </p>
        <h5>
          ደስ ይበላችሁ!! አሁን 1369 መጽሐፍ እኛ ቤተ-መጽሐፍት ዉስጥ አለ፤ ተጨማሪም በመግባት ላይ ነው።
          ላይብረሪያችንን ለመጎብኘት ይህን ማስፈንጠሪያ ይንኩ! መልካም ንባብ!
        </h5>
      </div>
      <div className="coffee">
        <Image src={image} alt="coffee" layout="responsive" width={400} height={300} />
        <h4>
          ጤና ይስጥልኝ!! ወደ ትንሿ ቤታችን እንኳን ደህና መጡ። ቡና ፈልቷል ፤ ይቀመጡ። ቡናውን እየጠጡ
          በላይብረሪያችን ያሰባሰብናቸውን መጽሐፍት እንዲመለከቱ እንጋብዝዎታለን። ቶማስ አ ኬምፐስ የተባለው በ15ኛው
          ክፍለ ዘመን የኖረው ሆላንዳዊ ሰው ስለ ጥሩ መጽሐፍት የሚከተለውን ብሏል፤ " ለተጠማ ጎረቤት አንድ ብርጭቆ
          ቀዝቃዛ ውኃ የሚሰጥ ሰው ሽልማትን የሚቀበል ከሆነ፤ የዘላለም ሕየወት ምንጭ የሚያፈልቁ መጽሐፍትን ለጎረቤቶቹ
          የሚያቀርብ ሰው ሽልማት ምንኛ ከዚያ የላቀ ነው!" በመሆኑም እኛም እነዚህን ጠዋሚ የሆኑ መጽሐፍት በአልም ሁሉ
          ላሉ የአማርኛ ቋንቋ አን አንባቢዎች ስናቀርብ ከፍ ያለ ደስታ ይሰማናል። እነዚህን መጽሐፍት በማጥናት ለእለት
          ተእለት ኑሮ ምሪት ፤ ለዚህ ዘመን እግዚአብሔር ያለውን ዕቅድ እንዲሁም ወደፊት የሚሆነውን አስመልክቶ መረዳትን
          እንደሚያገኙ እናምናለን። እኛ በላፕስሊ/ብሩክስ ፋውንዴሽን ያለነው ለመጽሐፍቱ ጸሐፊዎች፤ ለተርጓሚዎች እና
          ለኤዲተሮች ከፍ ያለ ምስጋና እናቀርባለን። እንዲሁም የደራሲነት መብት ያላቸውን መጽሐፍትን በዚህ ዓይነት ሁኔታ
          እንድናቀርብ ለፈቀዱልን ሁሉ የላቀ ምስጋናችንን እናቀርባለን። የትኛውንም መጽሐፍት ለራስዎ መጠቀምም ሆነ ሌሎችን
          ያለ ክፍያ እንዲጠቀሙ ማድረግ ይችላሉ። በመጨሻም በዘኁቁ 6፡24᎑6 የእግዚአብሄር ቃል እንደሚናገረው ፥ "
          እግዚአብሄር ይባርክህ ፤ ይጠብቅህም ፤ እግዚአብሄር ፊቱን ያብራልህ፤ ... እግዚአብሄር ፊቱን ወደአንተ ያንሳ፤
          ... ሰላሙንም ይስጥሕ"
        </h4>
      </div>
      <div className="footer">
        <h3></h3>
      
      <table>
        <tbody>
          <tr>
            <td></td>
            <td>
              <Link href={"./english"}>
              Read this in English !
              </Link>
            </td>
          </tr>
          <tr>
            <td>
              ኢትዮጵያውያን ከጨዋ ባህላቸው የተነሳ ሌሎችን ደፍረው እንደማይነቅፉ በደምብ ይታወቃል፡፡ ነገር ግን
              ላይበራሪያችንን ስትጎበኙ ማንኛውም አይነት አስተያየት በመስጠት እድትረዱን እንጠይቃለን፡፡ እንደምታውቁ
              ችግሮችን ማወቅ ያስፈልጋል፡፡ ምንም አይነት ችግር ብታዩ በስልክ ቁጥር 972-578-0825 በመደወል
              ውይንም ኢሜል አድራሻችን texlap@juno.com በማድረግ እንድታሳውቁን በትሕትና እንጠይቃለን፡፡
            </td>
          </tr>
        </tbody>
      </table>
      </div>
    </div>
  );
}

export default page;
